"""Снабди каждый комментарий правильной командой."""

python3 -V  # команда для проверки текущей версии Питона
python3 # запуск интерпретатора Питона в режиме REPL 
    #В моей извращенской винде можно просто `python`
python3 -m venv foo  # создание виртуального окружения в текущей директории
source foo/bin/activate # активация вышесозданного виртуального окружения
(foo) $ deactivate # деактивация виртуального окружения
python3 run.py # запуск скрипта run.py находящегося в текущей директории
pip install requests # установка пакета requests через пакетный менеджер pip
